app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "picture", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-12 09:04:08.115854"], ["picture", "20150202103349.jpg"], ["text", "testpic this time."], ["title", "testpic"], ["updated_at", "2015-02-12 09:04:08.115854"]]
---
	def create
		#render plain: params[:article].inspect
		@article = Article.new(article_params)

		if @article.save

SELECT COUNT(*) FROM "articles"
SELECT  "articles".* FROM "articles"   ORDER BY title LIMIT 2 OFFSET 0
---
	def index
		#@articles = Article.all
	    @articles = Article.order("title").page(params[:page]).per(10)
	    @articles.each do |a|